#+TITLE: Write yourself a Git!
#+AUTHOR: [[mailto:thibault@thb.lt][Thibault Polge]]

#
# This file is part of wyag <https://wyag.thb.lt>
#
# Copyright (c) 2018-2022 Thibault Polge <thibault@thb.lt>
# All rights reserved
#
# Wyag is free software: you can redistribute it and/or modify it
# under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Wyag is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public
# License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Wyag.  If not, see <http://www.gnu.org/licenses/>.
#

#+LANGUAGE: en
#+OPTIONS: ':t ^:nil

#+SETUPFILE: org-html-themes/setup/theme-readtheorg-local.setup

#+begin_src emacs-lisp :exports none :results none
  (let ((org-babel-inline-result-wrap "%s")
        (org-confirm-babel-evaluate nil)
        (org-export-with-broken-links t))
        ;; FIXME set this to nil when releasing!
    (org-html-export-to-html)
    ;; publish only if I'm me
    (when (string= "thblt" (user-login-name))
      ;; @TODO use rsync instead. Just create a _dist dir, copy/rename
      ;; all the things and rsync to webserver.
      (shell-command "scp write-yourself-a-git.html k9.thb.lt:/var/www/wyag.thb.lt/index.html")
      (shell-command "scp -r org-html-themes/styles k9.thb.lt:/var/www/wyag.thb.lt/")))
#+end_src

* Introduction

This article is an attempt at explaining the [[https://git-scm.com/][Git version control
system]] from the bottom up, that is, starting at the most fundamental
level moving up from there.  This does not sound too easy, and has
been attempted multiple times with questionable success.  But there's
an easy way: all it takes to understand Git internals is to
reimplement Git from scratch.

No, don't run.

#+NAME: slocs
#+begin_src emacs-lisp :exports none
  ;; Compute line numbers.  We'll use that in a second.
  (shell-command-to-string
   "grep -v '^$' libwyag.py wyag | grep -v ' *#'  | wc -l")
#+end_src

It's not a joke, and it's really not complicated: if you read this
article top to bottom and write the code (or just clone [[https://github.com/thblt/write-yourself-a-git][the repository]]
--- but you should write the code yourself, really), you'll end up
with a program, called =wyag=, that will implement all the fundamental
features of git: =init=, =add=, =rm=, =status=, =commit=, =log=... in a way that
is perfectly compatible with =git= itself.  The last commit of this
article was actually created with =wyag=, not =git=.  And all that in
exactly call_slocs() lines of very simple Python code.

But isn't Git too complex for that?  That Git is complex is, in my
opinion, a misconception.  Git is a large program, with a lot of
features, that's true.  But the core of that program is actually
extremely simple, and its apparent complexity stems first from the
fact it's often deeply counterintuitive (and [[https://byorgey.wordpress.com/2009/01/12/abstraction-intuition-and-the-monad-tutorial-fallacy/][Git is a burrito]] blog
posts probably don't help).  But maybe what makes Git the most
confusing is the extreme simplicity /and/ power of its core model.  The
combination of core simplicity and powerful applications often makes
thing really hard to grasp, because of the mental jump required to
derive the variety of applications from the essential simplicity of
the fundamental abstraction (monads, anyone?)

Implementing Git will expose its fundamentals in all their naked
glory.

*What to expect?*  This article will implement and explain in great
details (if something is not clear, please [[#feedback][report it]]!) a very
simplified version of Git core commands.  I will keep the code simple
and to the point, so =wyag= won't come anywhere near the power of the
real git command-line --- but what's missing will be obvious, and
trivial to implement by anyone who wants to give it a try.  "Upgrading
wyag to a full-featured git library and CLI is left as an exercise to
the reader", as they say.

More precisely, we'll implement:

#+begin_src emacs-lisp :exports results :results list
  (mapcar
   (lambda (cmd)
     (format "=%s= ([[#cmd-%s][wyag source]]) [[https://git-scm.com/docs/git-%s][git man page]]" cmd cmd cmd))
   (list
    "add"
    "cat-file"
    "checkout"
    "commit"
    "hash-object"
    "init"
    "log"
    "ls-tree"
    "merge"
    "rebase"
    "rev-parse"
    "rm"
    "show-ref"
    "tag"))
#+end_src

#+RESULTS:
+ =add= ([[#cmd-add][wyag source]]) [[https://git-scm.com/docs/git-add][git man page]]
+ =cat-file= ([[#cmd-cat-file][wyag source]]) [[https://git-scm.com/docs/git-cat-file][git man page]]
+ =checkout= ([[#cmd-checkout][wyag source]]) [[https://git-scm.com/docs/git-checkout][git man page]]
+ =commit= ([[#cmd-commit][wyag source]]) [[https://git-scm.com/docs/git-commit][git man page]]
+ =hash-object= ([[#cmd-hash-object][wyag source]]) [[https://git-scm.com/docs/git-hash-object][git man page]]
+ =init= ([[#cmd-init][wyag source]]) [[https://git-scm.com/docs/git-init][git man page]]
+ =log= ([[#cmd-log][wyag source]]) [[https://git-scm.com/docs/git-log][git man page]]
+ =ls-tree= ([[#cmd-ls-tree][wyag source]]) [[https://git-scm.com/docs/git-ls-tree][git man page]]
+ =merge= ([[#cmd-merge][wyag source]]) [[https://git-scm.com/docs/git-merge][git man page]]
+ =rebase= ([[#cmd-rebase][wyag source]]) [[https://git-scm.com/docs/git-rebase][git man page]]
+ =rev-parse= ([[#cmd-rev-parse][wyag source]]) [[https://git-scm.com/docs/git-rev-parse][git man page]]
+ =rm= ([[#cmd-rm][wyag source]]) [[https://git-scm.com/docs/git-rm][git man page]]
+ =show-ref= ([[#cmd-show-ref][wyag source]]) [[https://git-scm.com/docs/git-show-ref][git man page]]
+ =tag= ([[#cmd-tag][wyag source]]) [[https://git-scm.com/docs/git-tag][git man page]]

You're not going to need to know much to follow this article: just
some basic Git (obviously), some basic Python, some basic shell.

 + First, I'm only going to assume some level of familiarity with the
   most basic *git commands* --- nothing like an expert level, but if
   you've never used =init=, =add=, =rm=, =commit= or =checkout=, you will be
   lost.
 + Language-wise, wyag will be implemented in *Python*.  Again, I won't
   use anything too fancy, and Python looks like pseudo-code anyways,
   so it will be easy to follow (ironically, the most complicated part
   will be the command-line arguments parsing logic, and you don't
   really need to understand that).  Yet, if you know programming but
   have never done any Python, I suggest you find a crash course
   somewhere in the internet just to get acquainted with the language.
 + =wyag= and =git= are terminal programs.  I assume you know your way
   inside a Unix terminal.  Again, you don't need to be a l77t h4x0r,
   but =cd=, =ls=, =rm=, =tree= and their friends should be in your toolbox.

#+BEGIN_warning
  *Note for Windows users*

  =wyag= should run on any Unix-like system with a Python interpreter,
  but I have absolutely no idea how it will behave on Windows.  The
  test suite absolutely requires a bash-compatible shell, which I
  assume the WSL can provide.  Also, if you are using WSL, make sure
  your `wyag` file uses Unix-style line endings ([[https://stackoverflow.com/questions/48692741/how-can-i-make-all-line-endings-eols-in-all-files-in-visual-studio-code-unix][See this
  StackOverflow solution if you use VS Code]]).  Feedback from Windows
  users would be appreciated!
#+END_warning

** Release information

#+begin_src emacs-lisp :exports results :results table
  (list
   '("Key" "Value")
   'hline
   `("Creation date" ,(current-time-string))
   `("On commit" ,(format "=%s= (%s)"
                       (car (magit-git-lines "describe" "--tags" "--always"))
                       (if (zerop (length (magit-git-lines "status" "--porcelain=v2")))
                           "clean" "*dirty*")))
   `("By" ,(format "%s (=%s= on =%s=)"
     (user-full-name)
     (user-login-name)
     (system-name)))
   `("Emacs version" ,emacs-version)
   `("Org-mode version" ,org-version))
#+end_src

#+RESULTS:
| Key              | Value                              |
|------------------+------------------------------------|
| Creation date    | Mon May 28 11:25:28 2018           |
| On commit        | =0.1.1= (clean)                      |
| By               | Thibault Polge (=thblt= on =maladict=) |
| Emacs version    | 26.1                               |
| Org-mode version | 9.1.13                             |

